#test.ys
read_verilog -sv alu.sv
read_verilog -sv imem.sv
read_verilog -sv pc.sv
read_verilog -sv rega.sv
read_verilog -sv dec.sv
read_verilog -sv top.sv
read_liberty -lib osu018_stdcells.lib
proc
#flatten
synth -auto-top
write_verilog synth.v
dfflibmap -liberty osu018_stdcells.lib
abc -D 5000 -liberty osu018_stdcells.lib
stat -liberty ../../osu018_stdcells.lib
write_verilog gate.v
select top
show